documentation/ocp-rename-master/README.org
* Renaming a master node

  Let's say you've installed a new cluster and did a stupid mistake. One of your master nodes has to wrong name!

  #+begin_src
$ oc nodes
NAME       STATUS   ROLES    AGE   VERSION
master-0   Ready    master   10h   v1.19.0+7070803
master-1   Ready    master   10h   v1.19.0+7070803
master-3   Ready    master   10h   v1.19.0+7070803
worker-0   Ready    worker   10h   v1.19.0+7070803
worker-1   Ready    worker   10h   v1.19.0+7070803
  #+end_src

  We have a master node _master-3_ that we would like to rename to master-2.

** Verify ETCD status

   First change into the openshift-etcd project:

     #+begin_src
oc project openshift-etcd
  #+end_src

   #+begin_src sh
oc get etcd -o=jsonpath='{range .items[0].status.conditions[?(@.type=="EtcdMembersAvailable")]}{.message}{"\n"}'
   #+end_src

   this should print the following message

   #+begin_src sh
3 members are available
   #+end_src

   List all pods running ETCD:

   #+begin_src sh
oc get -l app=etcd pods -o wide
   #+end_src

   Connect to a ETCD pod that runs on a machine that has the *correct* name

   #+begin_src sh
oc rsh etcd-master-0
   #+end_src

   List ETCD members

   #+begin_src
sh-4.4# etcdctl member list -w table
+------------------+---------+----------+----------------------------+----------------------------+------------+
|        ID        | STATUS  |   NAME   |         PEER ADDRS         |        CLIENT ADDRS        | IS LEARNER |
+------------------+---------+----------+----------------------------+----------------------------+------------+
| 15875170f1aee131 | started | master-1 | https://172.16.100.21:2380 | https://172.16.100.21:2379 |      false |
| 385e47a681af114a | started | master-3 | https://172.16.100.22:2380 | https://172.16.100.22:2379 |      false |
| 9bbc83dcc657b718 | started | master-0 | https://172.16.100.20:2380 | https://172.16.100.20:2379 |      false |
+------------------+---------+----------+----------------------------+----------------------------+------------+
   #+end_src

   If all members are OK, especially the members that will stay in the
   cluster (master-0 and master-1 in our case) continue with shutting
   down the node to be replaced

