documentation/ocp-rename-master/README.org
** Removing the master with the wrong name from the cluster

   Connect to the master with the *wrong* name and shut it down

   #+begin_src h
$ ssh core@master-3
$ sudo systemctl poweroff
   #+end_src

   Verify that the API is still OK, this could take a while if master-3 was the main API server. The loadbalancer has to stop sending
   traffic to the shut down master-3 node.

   #+begin_src sh
oc get nodes
NAME       STATUS     ROLES    AGE   VERSION
master-0   Ready      master   10h   v1.19.0+7070803
master-1   Ready      master   10h   v1.19.0+7070803
master-3   NotReady   master   10h   v1.19.0+7070803
worker-0   Ready      worker   10h   v1.19.0+7070803
worker-1   Ready      worker   10h   v1.19.0+7070803
   #+end_src

   Be patient if the command hangs for a while.

   master-3 is now in the state NotReady

   Connect to one of the remaining ETCD pods

   #+begin_src
oc rsh etcd-master-0
   #+end_src

   Check the health of ETCD endpoints

   #+begin_src
sh-4.4# etcdctl endpoint health -w table
{"level":"warn","ts":"2021-01-16T08:45:58.099Z","caller":"clientv3/retry_interceptor.go:62","msg":"retrying of unary invoker failed","target":"endpoint://client-ce87cb52-7f7b-4084-b073-660db7e668f6/172.16.100.22:2379","attempt":0,"error":"rpc error: code = DeadlineExceeded desc = latest balancer error: all SubConns are in TransientFailure, latest connection error: connection error: desc = \"transport: Error while dialing dial tcp 172.16.100.22:2379: connect: no route to host\""}
+----------------------------+--------+--------------+---------------------------+
|          ENDPOINT          | HEALTH |     TOOK     |           ERROR           |
+----------------------------+--------+--------------+---------------------------+
| https://172.16.100.20:2379 |   true |    7.36417ms |                           |
| https://172.16.100.21:2379 |   true |   7.432035ms |                           |
| https://172.16.100.22:2379 |  false | 5.000180416s | context deadline exceeded |
+----------------------------+--------+--------------+---------------------------+
Error: unhealthy cluster
   #+end_src

   The member with ip 172.16.100.22 is unhealth, this is the master-3 node.

   Check the endpoint status of ETCD cluster members

   #+begin_src sh
sh-4.4# etcdctl endpoint status -w table
{"level":"warn","ts":"2021-01-16T08:48:06.308Z","caller":"clientv3/retry_interceptor.go:62","msg":"retrying of unary invoker failed","target":"passthrough:///https://172.16.100.22:2379","attempt":0,"error":"rpc error: code = DeadlineExceeded desc = latest balancer error: connection error: desc = \"transport: Error while dialing dial tcp 172.16.100.22:2379: connect: no route to host\""}
Failed to get the status of endpoint https://172.16.100.22:2379 (context deadline exceeded)
+----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
|          ENDPOINT          |        ID        | VERSION | DB SIZE | IS LEADER | IS LEARNER | RAFT TERM | RAFT INDEX | RAFT APPLIED INDEX | ERRORS |
+----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
| https://172.16.100.20:2379 | 9bbc83dcc657b718 |   3.4.9 |   92 MB |      true |      false |        12 |     258518 |             258518 |        |
| https://172.16.100.21:2379 | 15875170f1aee131 |   3.4.9 |   92 MB |     false |      false |        12 |     258518 |             258518 |        |
+----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
   #+end_src

   So the member with IP 172.16.100.20 is the current leader, master-3 (172.16.100.22) is not reachable.

   List the members of the cluster again

      #+begin_src
sh-4.4# etcdctl member list -w table
+------------------+---------+----------+----------------------------+----------------------------+------------+
|        ID        | STATUS  |   NAME   |         PEER ADDRS         |        CLIENT ADDRS        | IS LEARNER |
+------------------+---------+----------+----------------------------+----------------------------+------------+
| 15875170f1aee131 | started | master-1 | https://172.16.100.21:2380 | https://172.16.100.21:2379 |      false |
| 385e47a681af114a | started | master-3 | https://172.16.100.22:2380 | https://172.16.100.22:2379 |      false |
| 9bbc83dcc657b718 | started | master-0 | https://172.16.100.20:2380 | https://172.16.100.20:2379 |      false |
+------------------+---------+----------+----------------------------+----------------------------+------------+
   #+end_src

   Now we are going to remove master-3 from the ETCD cluster.

   *WARNING*: be extra careful to remove the right cluster member (master-3 in our case) in this step!

   #+begin_src sh
etcdctl member remove 385e47a681af114a
Member 385e47a681af114a removed from cluster b9e3f466bad0c744
   #+end_src

   Verify the member list again:

   #+begin_src sh
sh-4.4# etcdctl member list -w table
+------------------+---------+----------+----------------------------+----------------------------+------------+
|        ID        | STATUS  |   NAME   |         PEER ADDRS         |        CLIENT ADDRS        | IS LEARNER |
+------------------+---------+----------+----------------------------+----------------------------+------------+
| 15875170f1aee131 | started | master-1 | https://172.16.100.21:2380 | https://172.16.100.21:2379 |      false |
| 9bbc83dcc657b718 | started | master-0 | https://172.16.100.20:2380 | https://172.16.100.20:2379 |      false |
+------------------+---------+----------+----------------------------+----------------------------+------------+
   #+end_src

   Remove the master node from Openshift

   #+begin_src
oc delete node master-3
   #+end_src

   *WARNING*: As the cluster will reconfigure itself after this step it is possible that API request fail for example
   #+begin_src sh
   oc get co
Error from server (InternalError): an error on the server ("") has prevented the request from succeeding (get clusteroperators.config.openshift.io)
   #+end_src

   You have to be patient, everything should work again after a few minutes

   Check the state of clusteroperators:

#+begin_src sh
oc get co
NAME                                       VERSION   AVAILABLE   PROGRESSING   DEGRADED   SINCE
authentication                             4.6.8     True        False         False      15m
cloud-credential                           4.6.8     True        False         False      10h
cluster-autoscaler                         4.6.8     True        False         False      10h
config-operator                            4.6.8     True        False         False      10h
console                                    4.6.8     True        False         False      9h
csi-snapshot-controller                    4.6.8     True        False         False      9h
dns                                        4.6.8     True        False         False      10h
etcd                                       4.6.8     True        True          False      10h
image-registry                             4.6.8     True        False         False      10h
ingress                                    4.6.8     True        False         False      10h
insights                                   4.6.8     True        False         False      10h
kube-apiserver                             4.6.8     True        False         False      10h
kube-controller-manager                    4.6.8     True        False         False      10h
kube-scheduler                             4.6.8     True        False         False      10h
kube-storage-version-migrator              4.6.8     True        False         False      9h
machine-api                                4.6.8     True        False         False      10h
machine-approver                           4.6.8     True        False         False      10h
machine-config                             4.6.8     True        False         False      2m34s
marketplace                                4.6.8     True        False         False      9h
monitoring                                 4.6.8     False       True          True       2m23s
network                                    4.6.8     True        False         False      10h
node-tuning                                4.6.8     True        False         False      10h
openshift-apiserver                        4.6.8     True        True          False      15m
openshift-controller-manager               4.6.8     True        False         False      10h
openshift-samples                          4.6.8     True        False         False      10h
operator-lifecycle-manager                 4.6.8     True        False         False      10h
operator-lifecycle-manager-catalog         4.6.8     True        False         False      10h
operator-lifecycle-manager-packageserver   4.6.8     True        False         False      9h
service-ca                                 4.6.8     True        False         False      10h
storage                                    4.6.8     True        False         False      10h
#+end_src

   The ETCD cluster operator will stay in the degraded state as long as there's no third cluster member. This is expected!

   #+begin_src sh
oc describe co etcd
.
.
.
    Message: ScriptControllerDegraded: "configmap/etcd-pod": missing env var values EnvVarControllerDegraded: at least three nodes are required to have a valid configuration
.
.
.
   #+end_src

   Remove remaining ETCD secrets in the OpenShift namespace

   #+begin_src sh
oc delete secret -n openshift-etcd etcd-peer-master-3
oc delete secret -n openshift-etcd etcd-serving-master-3
oc delete secret -n openshift-etcd etcd-serving-metrics-master-3
   #+end_src

