documentation/ocp-rename-master/README.md


<a id="orgf2cc05d"></a>

## Adding the third ETCD member and OpenShift cluster member back to the cluster

Reinstall the third master with the correct name. If you are using [OCP4 helpernode](https://github.com/RedHatOfficial/ocp4-helpernode.git), fix the name of the master in vars.yaml and apply the playbook gain

    ansible-playbook tasks/main.yml -e @vars.yaml

Reinstall the third master and wait for the CSR:

    # oc get csr
    NAME        AGE   SIGNERNAME                                    REQUESTOR                                                                   CONDITION
    csr-k54wk   94s   kubernetes.io/kube-apiserver-client-kubelet   system:serviceaccount:openshift-machine-config-operator:node-bootstrapper   Pending

Sign the CSR:

    oc adm certificate approve csr-k54wk
    certificatesigningrequest.certificates.k8s.io/csr-k54wk approved

Wait for the second CSR and sign it:

    # oc get csr |grep Pending
    csr-t54rb   21s     kubernetes.io/kubelet-serving                 system:node:master-2                                                        Pending
    # oc adm certificate approve csr-t54rb
    certificatesigningrequest.certificates.k8s.io/csr-t54rb approved

Verify cluster nodes:

    # oc get nodes
    NAME       STATUS   ROLES    AGE   VERSION
    master-0   Ready    master   11h   v1.19.0+7070803
    master-1   Ready    master   11h   v1.19.0+7070803
    master-2   Ready    master   79s   v1.19.0+7070803
    worker-0   Ready    worker   10h   v1.19.0+7070803
    worker-1   Ready    worker   10h   v1.19.0+7070803

**master-2** successfully joined the cluster!

Verify the number of ETCD members:

    # oc get etcd -o=jsonpath='{range .items[0].status.conditions[?(@.type=="EtcdMembersAvailable")]}{.message}{"\n"}'
    3 members are available

Verify ETCD status in one of the etcd pods, we could select the new cluster member master-2 for our tests:

    # oc get -l app=etcd pods -o wide
    NAME            READY   STATUS    RESTARTS   AGE     IP              NODE       NOMINATED NODE   READINESS GATES
    etcd-master-0   3/3     Running   0          2m8s    172.16.100.20   master-0   <none>           <none>
    etcd-master-1   3/3     Running   0          101s    172.16.100.21   master-1   <none>           <none>
    etcd-master-2   3/3     Running   0          2m35s   172.16.100.22   master-2   <none>           <none>
    # oc rsh etcd-master-2
    sh-4.4# etcdctl member list -w table
    +------------------+---------+----------+----------------------------+----------------------------+------------+
    |        ID        | STATUS  |   NAME   |         PEER ADDRS         |        CLIENT ADDRS        | IS LEARNER |
    +------------------+---------+----------+----------------------------+----------------------------+------------+
    | 15875170f1aee131 | started | master-1 | https://172.16.100.21:2380 | https://172.16.100.21:2379 |      false |
    | 69730a0d0968d36e | started | master-2 | https://172.16.100.22:2380 | https://172.16.100.22:2379 |      false |
    | 9bbc83dcc657b718 | started | master-0 | https://172.16.100.20:2380 | https://172.16.100.20:2379 |      false |
    +------------------+---------+----------+----------------------------+----------------------------+------------+
    sh-4.4# etcdctl endpoint status -w table
    +----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
    |          ENDPOINT          |        ID        | VERSION | DB SIZE | IS LEADER | IS LEARNER | RAFT TERM | RAFT INDEX | RAFT APPLIED INDEX | ERRORS |
    +----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
    | https://172.16.100.20:2379 | 9bbc83dcc657b718 |   3.4.9 |   92 MB |     false |      false |        61 |     269849 |             269849 |        |
    | https://172.16.100.21:2379 | 15875170f1aee131 |   3.4.9 |   92 MB |     false |      false |        61 |     269849 |             269849 |        |
    | https://172.16.100.22:2379 | 69730a0d0968d36e |   3.4.9 |   92 MB |      true |      false |        61 |     269849 |             269849 |        |
    +----------------------------+------------------+---------+---------+-----------+------------+-----------+------------+--------------------+--------+
    sh-4.4# etcdctl endpoint health -w table
    +----------------------------+--------+-------------+-------+
    |          ENDPOINT          | HEALTH |    TOOK     | ERROR |
    +----------------------------+--------+-------------+-------+
    | https://172.16.100.20:2379 |   true |  9.296099ms |       |
    | https://172.16.100.22:2379 |   true |  9.966355ms |       |
    | https://172.16.100.21:2379 |   true | 10.589346ms |       |
    +----------------------------+--------+-------------+-------+

Verify all cluster operators are ok. WAIT and be PATIENT if there are cluster operators progressing!

    # oc get co
    NAME                                       VERSION   AVAILABLE   PROGRESSING   DEGRADED   SINCE
    authentication                             4.6.8     True        False         False      23m
    cloud-credential                           4.6.8     True        False         False      11h
    cluster-autoscaler                         4.6.8     True        False         False      11h
    config-operator                            4.6.8     True        False         False      11h
    console                                    4.6.8     True        False         False      10h
    csi-snapshot-controller                    4.6.8     True        False         False      10h
    dns                                        4.6.8     True        False         False      11h
    etcd                                       4.6.8     True        False         False      11h
    image-registry                             4.6.8     True        False         False      11h
    ingress                                    4.6.8     True        False         False      11h
    insights                                   4.6.8     True        False         False      11h
    kube-apiserver                             4.6.8     True        False         False      11h
    kube-controller-manager                    4.6.8     True        False         False      11h
    kube-scheduler                             4.6.8     True        False         False      11h
    kube-storage-version-migrator              4.6.8     True        False         False      10h
    machine-api                                4.6.8     True        False         False      11h
    machine-approver                           4.6.8     True        False         False      11h
    machine-config                             4.6.8     True        False         False      26m
    marketplace                                4.6.8     True        False         False      10h
    monitoring                                 4.6.8     True        False         False      20m
    network                                    4.6.8     True        False         False      11h
    node-tuning                                4.6.8     True        False         False      10h
    openshift-apiserver                        4.6.8     True        False         False      38m
    openshift-controller-manager               4.6.8     True        False         False      10h
    openshift-samples                          4.6.8     True        False         False      10h
    operator-lifecycle-manager                 4.6.8     True        False         False      11h
    operator-lifecycle-manager-catalog         4.6.8     True        False         False      11h
    operator-lifecycle-manager-packageserver   4.6.8     True        False         False      18m
    service-ca                                 4.6.8     True        False         False      11h
    storage                                    4.6.8     True        False         False      11h

Just to be sure verify the cluster version:

    # oc get clusterversions.config.openshift.io
    NAME      VERSION   AVAILABLE   PROGRESSING   SINCE   STATUS
    version   4.6.8     True        False         10h     Cluster version is 4.6.8

**FINE**
